In [34]:
#Perform in Ordinal Data

In [33]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [2]:
dataset = pd.read_csv(r"D:\ML\WsCubeTech\data\loan\df1_loan.csv")
dataset.head(5)

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Total_Income
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,$5849.0
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,$6091.0
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,$3000.0
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,$4941.0
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,$6000.0

In [3]:
dataset.isnull().sum()

Unnamed: 0            0
Loan_ID               0
Gender                9
Married               3
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
Total_Income          0
dtype: int64

In [6]:
dataset["Gender"].fillna(dataset["Gender"].mode()[0],inplace=True)

In [7]:
dataset.isnull().sum()

Unnamed: 0            0
Loan_ID               0
Gender                0
Married               3
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
Total_Income          0
dtype: int64

In [8]:
dataset["Married"].fillna(dataset["Married"].mode()[0],inplace=True)

C:\Users\ashut\AppData\Local\Temp\ipykernel_8508\3070595742.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["Married"].fillna(dataset["Married"].mode()[0],inplace=True)

In [9]:
dataset.isnull().sum()

Unnamed: 0            0
Loan_ID               0
Gender                0
Married               0
Dependents           12
Education             0
Self_Employed        27
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Property_Area         0
Loan_Status           0
Total_Income          0
dtype: int64

In [10]:
#Process one

In [12]:
en_data = dataset[["Gender","Married"]]
en_data.head(5)

  Gender Married
0   Male      No
1   Male     Yes
2   Male     Yes
3   Male     Yes
4   Male      No

In [14]:
pd.get_dummies(en_data).head(5) #Perform encoding by pd

   Gender_Female  Gender_Male  Married_No  Married_Yes
0          False         True        True        False
1          False         True       False         True
2          False         True       False         True
3          False         True       False         True
4          False         True        True        False

In [19]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_Female  500 non-null    bool
 1   Gender_Male    500 non-null    bool
 2   Married_No     500 non-null    bool
 3   Married_Yes    500 non-null    bool
dtypes: bool(4)
memory usage: 2.1 KB

In [16]:
#Process second

In [28]:
# ohe = OneHotEncoder()
ohe = OneHotEncoder(drop="first")
ar = ohe.fit_transform(en_data).toarray()
# ar = ohe.fit_transform(en_data)

In [27]:
pd.DataFrame(ar,columns=["Gender_Female","Gender_Male","Married_No","Married_Yes"]).head(5)

   Gender_Female  Gender_Male  Married_No  Married_Yes
0            0.0          1.0         1.0          0.0
1            0.0          1.0         0.0          1.0
2            0.0          1.0         0.0          1.0
3            0.0          1.0         0.0          1.0
4            0.0          1.0         1.0          0.0

In [32]:
pd.DataFrame(ar,columns=["Gender_Male","Married_Yes"]).head(5)

   Gender_Male  Married_Yes
0          1.0          0.0
1          1.0          1.0
2          1.0          1.0
3          1.0          1.0
4          1.0          0.0